# SF Salaries Dataset

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\10-Me22\Downloads\Salaries.csv")
df

C:\Users\10-Me22\AppData\Local\Temp\ipykernel_14840\325250556.py:1: DtypeWarning: Columns (12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(r"C:\Users\10-Me22\Downloads\Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148643,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148644,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148645,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148646,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,PT
148647,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [3]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148648 entries, 0 to 148647
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148648 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148648 non-null  object
 3   BasePay           148043 non-null  float64
 4   OvertimePay       148648 non-null  float64
 5   OtherPay          148648 non-null  float64
 6   Benefits          112490 non-null  float64
 7   TotalPay          148648 non-null  float64
 8   TotalPayBenefits  148648 non-null  float64
 9   Year              148648 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148648 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [5]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148648.000000,148043.000000,148648.000000,148648.000000,112490.000000,148648.000000,148648.000000,148648.000000,0.0
mean,74326.110220,66325.398119,5065.821161,3648.761721,25007.777439,74770.035453,93694.776345,2012.522617,NaN
std,42911.633315,42764.898947,11454.266982,8056.655841,15402.235424,50516.440633,62792.743250,1.117526,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN
25%,37163.750000,33587.350000,0.000000,0.000000,11535.192500,36169.370000,44072.062500,2012.000000,NaN
50%,74326.500000,65007.450000,0.000000,811.205000,28628.365000,71427.130000,92406.020000,2013.000000,NaN
75%,111488.250000,94691.050000,4657.597500,4236.035000,35566.790000,105840.920000,132876.997500,2014.000000,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

Average of BasePay

In [6]:
df['BasePay'].mean()

66325.39811865473

highest OvertimePay

In [7]:
df['OvertimePay'].max()

245131.88

Find jop title for employees depending on their name

In [8]:
df[df['EmployeeName']=='PATRICK GARDNER']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [9]:
df[df['EmployeeName']=='PATRICK GARDNER']['JobTitle']

4    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
Name: JobTitle, dtype: object

How much does this employee make

In [10]:
#with benefits
df[df['EmployeeName']=='PATRICK GARDNER']['TotalPay']

4    326373.19
Name: TotalPay, dtype: float64

In [11]:
#with benefits
df[df['EmployeeName']=='PATRICK GARDNER']['TotalPayBenefits']

4    326373.19
Name: TotalPayBenefits, dtype: float64

What is name of highest paid employee including benefits

In [14]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

What is name of lowest paid employee including benefits

In [15]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]['EmployeeName']

148647    Joe Lopez
Name: EmployeeName, dtype: object

What was the average BasePay of all employees per year (2011-2014)

In [16]:
df.groupby('Year').mean()['BasePay']

C:\Users\10-Me22\AppData\Local\Temp\ipykernel_14840\40158212.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Year').mean()['BasePay']

Year
2011    63596.112293
2012    65435.950986
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

How many unique jio titles we have

In [17]:
df['JobTitle'].nunique()

2158

Top 5 most common jop

In [18]:
df['JobTitle'].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

Last 5 most common jop

In [20]:
df['JobTitle'].value_counts().tail(5)

BUILDING SERVICES TECHNICIAN            1
TRIAL DELAY REDUCTION COORDINATOR       1
POWERHOUSE ELECTRICIAN SUPERVISOR II    1
CHIEF NURSERY SPECIALIST                1
Cashier 3                               1
Name: JobTitle, dtype: int64

Num of Jop titles with only one occurrence in 2013

In [21]:
(df[df['Year']==2013]['JobTitle'].value_counts()==1).sum()

202

Num of employee have word Chief in their jop title

In [23]:
#build function
def chief(string):
    if 'chief' in (string.lower()):
        return True
    else:
        return False

In [24]:
(df['JobTitle'].apply(lambda x: chief(x))).sum()

627

Correlation between length of jop title and salary

In [25]:
df['numTitle'] = df['JobTitle'].apply(len)

In [26]:
df['numTitle']

0         46
1         31
2         31
3         36
4         44
          ..
148643    25
148644    27
148645     9
148646     9
148647    26
Name: numTitle, Length: 148648, dtype: int64

In [27]:
df[['numTitle','TotalPayBenefits']].corr()
#we note there is no correlation

                  numTitle  TotalPayBenefits
numTitle           1.00000          -0.03692
TotalPayBenefits  -0.03692           1.00000